app/views/lablocationals/_form.html.erb

SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
---
   <td><%= f.label :labid ,"Central Lab"%></td>
    <td><%= f.collection_select :labcentral_id, Labcentral.find(:all), :id, :labid ,{:prompt=>'Select CentralLab'},{ :onchange=>"#{remote_function(:url=>{:action=>'load_regional'},:with =>"'id='+value")}" }%></td>