app/views/states/show.html.erb

SELECT `countries`.* FROM `countries` ORDER BY name
---
    <td>Country</td>
    <td><%= @state.country.name %></td>