app/controllers/admin_controller.rb

  def index
	@user = User.find(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) ORDER BY name LIMIT 1