app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY name
---
  def index
    @categories = Category.all

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 4) ORDER BY name LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) ORDER BY name LIMIT 1
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`modified_by`, `name`, `created_by`, `created_at`, `updated_at`, `status`, `description`) VALUES (NULL, 'Processed Foods', NULL, '2011-02-02 10:34:45', '2011-02-02 10:34:45', 'Active', 'Processed Foods')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) ORDER BY name LIMIT 1
UPDATE `categories` SET `description` = 'Agricultural', `updated_at` = '2011-02-02 10:40:45' WHERE (`categories`.`id` = 1)
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 8) ORDER BY name LIMIT 1
DELETE FROM `categories` WHERE (`categories`.`id` = 8)
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy