app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY name
---
  def show
    @category = Category.all

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) ORDER BY name LIMIT 1
---
  def view
    @category = Category.find(params[:id])