app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT `cities`.* FROM `cities` ORDER BY name, country_id

  def show
	@state = State.all
	@country = Country.all
    @city = City.find(params[:id])
---
SELECT `states`.* FROM `states`
SELECT `countries`.* FROM `countries`
SELECT `cities`.* FROM `cities` WHERE (`cities`.`id` = 1) LIMIT 1

  def new
	@state = State.all
	@country = Country.all
---
SELECT `states`.* FROM `states`
SELECT `countries`.* FROM `countries` ORDER BY name

  def edit
	@state = State.all
	@country = Country.all
    @city = City.find(params[:id])
---
SELECT `states`.* FROM `states` ORDER BY name
SELECT `countries`.* FROM `countries` ORDER BY name
SELECT `cities`.* FROM `cities` WHERE (`cities`.`id` = 1) ORDER BY country_id LIMIT 1

  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save
---
INSERT INTO `cities` (`description`, `updated_at`, `modified_by`, `country_id`, `status`, `name`, `created_by`, `created_at`, `state_id`) VALUES ('', '2011-01-20 10:34:06', NULL, NULL, 'A', 'sdafsadfsadfsadfsdfsdfsdfsad', NULL, '2011-01-20 10:34:06', NULL)

  def update
    @city = City.find(params[:id])

    respond_to do |format|
      if @city.update_attributes(params[:city])
---
SELECT `cities`.* FROM `cities` WHERE (`cities`.`id` = 1) LIMIT 1
UPDATE `cities` SET `description` = 'Vijayawada1', `updated_at` = '2011-01-11 11:17:48' WHERE (`cities`.`id` = 1)

  def destroy
    @city = City.find(params[:id])
    @city.destroy
---
SELECT `cities`.* FROM `cities` WHERE (`cities`.`id` = 3) LIMIT 1
DELETE FROM `cities` WHERE (`cities`.`id` = 3)