app/controllers/cities_controller.rb

SELECT `states`.* FROM `states` WHERE (`states`.`country_id` = 2) ORDER BY name
---
	def load_states
	#puts "#### Country Id - #{params[:id]}"
		@states = State.where(:country_id => params[:id])