app/controllers/countries_controller.rb

SELECT `countries`.* FROM `countries` ORDER BY name
---
  def index
    @countries = Country.all

SELECT `countries`.* FROM `countries` ORDER BY name
---
  def show
    @country = Country.all

SELECT `countries`.* FROM `countries` WHERE (`countries`.`id` = 1) ORDER BY name LIMIT 1
---
  def view
    @country = Country.find(params[:id])

SELECT `countries`.* FROM `countries` WHERE (`countries`.`id` = 1) ORDER BY name LIMIT 1
---
  def edit
    @country = Country.find(params[:id])

INSERT INTO `countries` (`modified_by`, `name`, `status`, `updated_at`, `created_by`, `created_at`, `description`) VALUES (NULL, 'USA', 'Active', '2011-02-02 10:46:34', NULL, '2011-02-02 10:46:34', 'USA')
---
  def create
    @country = Country.new(params[:country])

    respond_to do |format|
      if @country.save

SELECT `countries`.* FROM `countries` WHERE (`countries`.`id` = 2) ORDER BY name LIMIT 1
---
  def update
    @country = Country.find(params[:id])

SELECT `countries`.* FROM `countries` WHERE (`countries`.`id` = 2) ORDER BY name LIMIT 1
DELETE FROM `countries` WHERE (`countries`.`id` = 1)
---
  def destroy
    @country = Country.find(params[:id])
    @country.destroy