app/controllers/countries_controller.rb

SELECT `countries`.* FROM `countries` WHERE (`countries`.`id` = 1) ORDER BY name LIMIT 1
---
  def show
    @country = Country.find(params[:id])