app/controllers/customers_controller.rb

  def index
#    @customers = Customer.all
#pagination:
	@customers = Customer.all.paginate :per_page => 5, :page => params[:page]
---
SELECT `customers`.* FROM `customers` ORDER BY customername

  def show
    @customer = Customer.all
---
SELECT `customers`.* FROM `customers` ORDER BY customername

    def view
    @customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE (`customers`.`id` = 1) ORDER BY customername LIMIT 1

  def edit
    @customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE (`customers`.`id` = 1) ORDER BY customername LIMIT 1

  def create
    @customer = Customer.new(params[:customer])
    @user = User.find(session[:user_id])
    @customer.created_by = @user.name
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) ORDER BY name LIMIT 1
INSERT INTO `customers` (`customertype`, `state`, `customerclass`, `mobile`, `street`, `organizationname`, `housenumber`, `customerid`, `customername`, `email`, `phone`, `pincode`, `remarks`, `city`, `area`, `created_by`, `groupname`, `contactperson`, `created_at`, `modified_by`, `updated_at`, `country`) VALUES ('Organization', 'Rajasthan', 'Non-Agreement', '0154-2472121', 'Newmandi Yard', NULL, '168', 'CU/2011/1', 'Manoj Traders', 'sanjay@in.com', '0154-2472121', '123456', '', 'Sriganga Nagar', 'Sriganga Nagar', NULL, NULL, NULL, '2011-02-04 11:36:22', NULL, '2011-02-04 11:36:22', 'India')

  def update
    @customer = Customer.find(params[:id])
    @user = User.find(session[:user_id])
    @customer.modified_by = @user.name
    respond_to do |format|
      if @customer.update_attributes(params[:customer])
---
SELECT `customers`.* FROM `customers` WHERE (`customers`.`id` = 1) ORDER BY customername LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) ORDER BY name LIMIT 1
UPDATE `customers` SET `updated_at` = '2011-02-04 12:06:26', `contactperson` = 'sanjay' WHERE (`customers`.`id` = 1)

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT `customers`.* FROM `customers` WHERE (`customers`.`id` = 2) ORDER BY customername LIMIT 1
DELETE FROM `customers` WHERE (`customers`.`id` = 2)