app/controllers/exchanges_controller.rb

  def index
    @exchanges = Exchange.all
---
SELECT `exchanges`.* FROM `exchanges` ORDER BY name

  def show
    @exchange = Exchange.find(params[:id])
---
SELECT `exchanges`.* FROM `exchanges` WHERE (`exchanges`.`id` = 4) ORDER BY name LIMIT 1

  def edit
    @exchange = Exchange.find(params[:id])
---
SELECT `exchanges`.* FROM `exchanges` WHERE (`exchanges`.`id` = 4) ORDER BY name LIMIT 1

  def create
    @exchange = Exchange.new(params[:exchange])

    respond_to do |format|
      if @exchange.save
---
INSERT INTO `exchanges` (`description`, `status`, `updated_at`, `created_by`, `modified_by`, `created_at`, `name`) VALUES ('BSE', 'A', '2011-01-16 12:18:46', NULL, NULL, '2011-01-16 12:18:46', 'BSE')

  def destroy
    @exchange = Exchange.find(params[:id])
    @exchange.destroy
---
SELECT `exchanges`.* FROM `exchanges` WHERE (`exchanges`.`id` = 4) ORDER BY name LIMIT 1
DELETE FROM `exchanges` WHERE (`exchanges`.`id` = 4)