app/controllers/labcentrals_controller.rb

SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
---
  def show
    @labcentral = Labcentral.all

SELECT `labcentrals`.* FROM `labcentrals` WHERE (`labcentrals`.`id` = 1) ORDER BY labname LIMIT 1
---
  def view
    @labcentral = Labcentral.find(params[:id])