app/controllers/labcentrals_controller.rb

SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
---
  def index
    @labcentrals = Labcentral.all

SELECT `labcentrals`.* FROM `labcentrals` WHERE (`labcentrals`.`id` = 1) LIMIT 1
---
  def show
    @labcentral = Labcentral.find(params[:id])

SELECT `labcentrals`.* FROM `labcentrals` WHERE (`labcentrals`.`id` = 1) ORDER BY labname LIMIT 1
---
  def edit
    @labcentral = Labcentral.find(params[:id])

SELECT MAX(`labcentrals`.`id`) AS max_id FROM `labcentrals`
INSERT INTO `labcentrals` (`email`, `housenumber`, `labid`, `state`, `area`, `landmark`, `city`, `country`, `fax`, `street`, `created_by`, `pincode`, `modified_by`, `land`, `labname`, `status`, `created_at`, `mobile`, `updated_at`) VALUES ('1312', '123', 'CEN/2011/1', 'sdf', '13', '3423', 'fsdas', NULL, '1231', '123', NULL, 'dfa', NULL, '122', 'Mumbai', 'A', '2011-01-15 06:04:56', '231', '2011-01-15 06:04:56')
---
  def create
    @labcentral = Labcentral.new(params[:labcentral])
	@labcentral.labid = @labcentral.max

    respond_to do |format|
      if @labcentral.save

SELECT `labcentrals`.* FROM `labcentrals` WHERE (`labcentrals`.`id` = 1) ORDER BY labname LIMIT 1
---
  def update
    @labcentral = Labcentral.find(params[:id])

SELECT `labcentrals`.* FROM `labcentrals` WHERE (`labcentrals`.`id` = 2) LIMIT 1
DELETE FROM `labcentrals` WHERE (`labcentrals`.`id` = 2)
---
  def destroy
    @labcentral = Labcentral.find(params[:id])
    @labcentral.destroy