app/controllers/lablocationals_controller.rb

  def new
	@labcentral = Labcentral.all
	@labregional = Labregional.all
---
SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
SELECT `labregionals`.* FROM `labregionals`