app/controllers/lablocationals_controller.rb

  def index
    @lablocationals = Lablocational.all
---
SELECT `lablocationals`.* FROM `lablocationals` ORDER BY labname

  def show
	@labcentral = Labcentral.all
	@labregional = Labregional.all
    @lablocational = Lablocational.find(params[:id])
---
SELECT `labcentrals`.* FROM `labcentrals`
SELECT `labregionals`.* FROM `labregionals`
SELECT `lablocationals`.* FROM `lablocationals` WHERE (`lablocationals`.`id` = 0) ORDER BY labname LIMIT 1

  def edit
	@labcentral = Labcentral.all
	@labregional = Labregional.all
    @lablocational = Lablocational.find(params[:id])
---
SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
SELECT `labregionals`.* FROM `labregionals` ORDER BY labname
SELECT `lablocationals`.* FROM `lablocationals` WHERE (`lablocationals`.`id` = 1) ORDER BY labname LIMIT 1

  def create
    @lablocational = Lablocational.new(params[:lablocational])
	@lablocational.labid = @lablocational.max

    respond_to do |format|
      if @lablocational.save
        format.html { redirect_to(@lablocational, :notice => 'Lablocational was successfully created.') }
        format.xml  { render :xml => @lablocational, :status => :created, :location => @lablocational }
      else
	@labcentral = Labcentral.all
	@labregional = Labregional.all
---
SELECT MAX(`lablocationals`.`id`) AS max_id FROM `lablocationals`
INSERT INTO `lablocationals` (`labregional_id`, `updated_at`, `labcentral_id`, `city`, `labname`, `mobile`, `labid`, `land`, `housenumber`, `email`, `created_by`, `created_at`, `country`, `street`, `status`, `landmark`, `modified_by`, `area`, `pincode`, `state`, `fax`) VALUES (NULL, '2011-01-15 14:50:32', NULL, '', 'Location', '', 'LOC/1', '', '', '', NULL, '2011-01-15 14:50:32', NULL, '', 'A', '', NULL, '', '', '', '')
SELECT `labcentrals`.* FROM `labcentrals`
SELECT `labregionals`.* FROM `labregionals`

	def load_regional
		@labregionals = Labregional.where(:labcentral_id => params[:id])
---
SELECT `labregionals`.* FROM `labregionals` WHERE (`labregionals`.`labcentral_id` = 1) ORDER BY labname