app/controllers/lablocationals_controller.rb

SELECT `lablocationals`.* FROM `lablocationals` ORDER BY labname
---
  def show
    @lablocational = Lablocational.all

SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
SELECT `labregionals`.* FROM `labregionals` ORDER BY labname
SELECT `lablocationals`.* FROM `lablocationals` WHERE (`lablocationals`.`id` = 1) ORDER BY labname LIMIT 1
---
  def view
	@labcentral = Labcentral.all
	@labregional = Labregional.all
    @lablocational = Lablocational.find(params[:id])