app/controllers/labregionals_controller.rb

SELECT `labcentrals`.* FROM `labcentrals`
SELECT `labregionals`.* FROM `labregionals` WHERE (`labregionals`.`id` = 1) LIMIT 1
---
  def show
	@labcentral = Labcentral.all
    @labregional = Labregional.find(params[:id])

SELECT MAX(`labregionals`.`id`) AS max_id FROM `labregionals`
---
  def create

    @labregional = Labregional.new(params[:labregional])
	@labregional.labid = @labregional.max