app/controllers/labregionals_controller.rb

  def index
#    @labregionals = Labregional.all
#pagination:
	@labregionals = Labregional.all.paginate :per_page => 5, :page => params[:page]
---
SELECT `labregionals`.* FROM `labregionals` ORDER BY labname

  def show
    @labregional = Labregional.all
---
SELECT `labregionals`.* FROM `labregionals` ORDER BY labname

  def view
	@labcentral = Labcentral.all
    @labregional = Labregional.find(params[:id])
---
SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
SELECT `labregionals`.* FROM `labregionals` WHERE (`labregionals`.`id` = 1) ORDER BY labname LIMIT 1

  def new
	@labcentral = Labcentral.all
---
SELECT `labcentrals`.* FROM `labcentrals`

  def edit
	@labcentral = Labcentral.all
    @labregional = Labregional.find(params[:id])
---
SELECT `labcentrals`.* FROM `labcentrals` ORDER BY labname
SELECT `labregionals`.* FROM `labregionals` WHERE (`labregionals`.`id` = 1) ORDER BY labname LIMIT 1

  def create

    @labregional = Labregional.new(params[:labregional])
#	@labregional.labid = @labregional.max

    respond_to do |format|
      if @labregional.save
        format.html { redirect_to(labregionals_path, :notice => 'Regional Lab was successfully created.') }
        format.xml  { render :xml => @labregional, :status => :created, :location => @labregional }
      else
	@labcentral = Labcentral.all
---
INSERT INTO `labregionals` (`fax`, `mobile`, `labid`, `landmark`, `updated_at`, `area`, `created_at`, `labname`, `country`, `housenumber`, `email`, `modified_by`, `land`, `state`, `labcentral_id`, `city`, `street`, `status`, `created_by`, `pincode`) VALUES ('', '', 'REG/1', '', '2011-01-15 12:44:05', '', '2011-01-15 12:44:05', 'Regional', NULL, '', '', NULL, '', '', 4, '', '', 'A', NULL, '')
SELECT `labcentrals`.* FROM `labcentrals`

  def update
    @labregional = Labregional.find(params[:id])
---
SELECT `labregionals`.* FROM `labregionals` WHERE (`labregionals`.`id` = 1) ORDER BY labname LIMIT 1