app/controllers/packings_controller.rb

  def index
    @packings = Packing.all
---
SELECT `packings`.* FROM `packings` ORDER BY name

  def show
    @packing = Packing.find(params[:id])
---
SELECT `packings`.* FROM `packings` WHERE (`packings`.`id` = 1) ORDER BY name LIMIT 1

  def edit
    @packing = Packing.find(params[:id])
---
SELECT `packings`.* FROM `packings` WHERE (`packings`.`id` = 2) ORDER BY name LIMIT 1