app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY name
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 4) ORDER BY name LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `categories`.* FROM `categories` ORDER BY name
SELECT `subcategories`.* FROM `subcategories`
---
  def new
	@category = Category.all
	@subcategory = Subcategory.all

SELECT `categories`.* FROM `categories` ORDER BY name
SELECT `subcategories`.* FROM `subcategories`
SELECT `products`.* FROM `products` WHERE (`products`.`id` = 4) ORDER BY name LIMIT 1
---
  def edit
	@category = Category.all
	@subcategory = Subcategory.all

    @product = Product.find(params[:id])

INSERT INTO `products` (`modified_by`, `created_at`, `subcategory_id`, `category_id`, `name`, `status`, `description`, `created_by`, `updated_at`) VALUES (NULL, '2011-02-02 13:40:32', 8, 4, 'Hydrofluoric Acid', 'Active', 'Hydrofluoric Acid', NULL, '2011-02-02 13:40:32')
SELECT `categories`.* FROM `categories`
SELECT `subcategories`.* FROM `subcategories`
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
        format.html { redirect_to(@product, :notice => 'Product was successfully created.') }
        format.xml  { render :xml => @product, :status => :created, :location => @product }
      else
	@category = Category.all
	@subcategory = Subcategory.all

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 2) ORDER BY name LIMIT 1
UPDATE `products` SET `updated_at` = '2011-02-02 13:37:27', `description` = 'Barley' WHERE (`products`.`id` = 1)
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])