app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY name
---
  def show
    @product = Product.all

SELECT `products`.* FROM `products` WHERE (`products`.`id` = 4) ORDER BY name LIMIT 1
---
  def view
    @product = Product.find(params[:id])

SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`category_id` = 1) ORDER BY name
---
	def load_subcategries
	#puts "#### Country Id - #{params[:id]}"
		@subcategories = Subcategory.where(:category_id => params[:id])