app/controllers/sampleconditions_controller.rb

SELECT `sampleconditions`.* FROM `sampleconditions`
---
  def index
    @sampleconditions = Samplecondition.all