app/controllers/sampleplaces_controller.rb

  def index
    @sampleplaces = Sampleplace.all
---
SELECT `sampleplaces`.* FROM `sampleplaces`

  def show
    @sampleplace = Sampleplace.find(params[:id])
---
SELECT `sampleplaces`.* FROM `sampleplaces` WHERE (`sampleplaces`.`id` = 1) LIMIT 1