app/controllers/sampleunits_controller.rb

  def index
    @sampleunits = Sampleunit.all
---
SELECT `sampleunits`.* FROM `sampleunits`