app/controllers/seals_controller.rb

  def index
    @seals = Seal.all
---
SELECT `seals`.* FROM `seals`

  def show
    @seal = Seal.find(params[:id])
---
SELECT `seals`.* FROM `seals` WHERE (`seals`.`id` = 3) LIMIT 1