app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT `states`.* FROM `states` ORDER BY name

  def show
	@country = Country.all
    @state = State.find(params[:id])
---
SELECT `countries`.* FROM `countries` ORDER BY name
SELECT `states`.* FROM `states` WHERE (`states`.`id` = 1) ORDER BY name LIMIT 1

  def new
	@country = Country.all
---
SELECT `countries`.* FROM `countries` ORDER BY name

  def create
    @state = State.new(params[:state])

    respond_to do |format|
      if @state.save
---
INSERT INTO `states` (`description`, `created_by`, `status`, `created_at`, `name`, `updated_at`, `modified_by`, `country_id`) VALUES ('Andhra Pradesh', NULL, 'A', '2011-01-15 05:43:29', 'Andhra Pradesh', '2011-01-15 05:43:29', NULL, 1)

  def destroy
    @state = State.find(params[:id])
    @state.destroy
---
SELECT `states`.* FROM `states` WHERE (`states`.`id` = 34) ORDER BY name LIMIT 1
DELETE FROM `states` WHERE (`states`.`id` = 3)