app/controllers/states_controller.rb

SELECT `states`.* FROM `states` ORDER BY name
---
  def show
#	@country = Country.all
    @state = State.all