app/controllers/subcategories_controller.rb

  def index
    @subcategories = Subcategory.all
---
SELECT `subcategories`.* FROM `subcategories` ORDER BY name

  def show
	@category = Category.all
    @subcategory = Subcategory.find(params[:id])
---
SELECT `categories`.* FROM `categories` ORDER BY name
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 4) ORDER BY name LIMIT 1
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`id` = 4) ORDER BY name LIMIT 1

  def new
	@category = Category.all
---
SELECT `categories`.* FROM `categories` ORDER BY name

  def edit
	@category = Category.all
    @subcategory = Subcategory.find(params[:id])
---
SELECT `categories`.* FROM `categories` ORDER BY name
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`id` = 1) ORDER BY name LIMIT 1

  def create
    @subcategory = Subcategory.new(params[:subcategory])

    respond_to do |format|
      if @subcategory.save
---
INSERT INTO `subcategories` (`description`, `name`, `created_at`, `status`, `category_id`, `created_by`, `updated_at`, `modified_by`) VALUES ('Hydrofluoric Acid', 'Hydrofluoric Acid', '2011-02-02 10:54:10', 'Active', 4, NULL, '2011-02-02 10:54:10', NULL)

  def update

    @subcategory = Subcategory.find(params[:id])

    respond_to do |format|
      if @subcategory.update_attributes(params[:subcategory])
---
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`id` = 1) ORDER BY name LIMIT 1
UPDATE `subcategories` SET `updated_at` = '2011-02-02 11:03:22', `description` = 'Fruit Juice' WHERE (`subcategories`.`id` = 3)