app/controllers/subcategories_controller.rb

SELECT `subcategories`.* FROM `subcategories` ORDER BY name
---
  def show
    @subcategory = Subcategory.all

SELECT `categories`.* FROM `categories` ORDER BY name
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 4) ORDER BY name LIMIT 1
SELECT `subcategories`.* FROM `subcategories` WHERE (`subcategories`.`id` = 4) ORDER BY name LIMIT 1
---
  def view
	@category = Category.all
    @subcategory = Subcategory.find(params[:id])