app/controllers/teststandards_controller.rb

  def index
    @teststandards = Teststandard.all
---
SELECT `teststandards`.* FROM `teststandards`

  def show
    @teststandard = Teststandard.find(params[:id])
---
SELECT `teststandards`.* FROM `teststandards` WHERE (`teststandards`.`id` = 3) LIMIT 1