app/controllers/testparameters_controller.rb

  def index
    @testparameters = Testparameter.all
---
SELECT `testparameters`.* FROM `testparameters`