app/controllers/testrequires_controller.rb

SELECT `testrequires`.* FROM `testrequires`
---
  def index
    @testrequires = Testrequire.all