app/controllers/testmethods_controller.rb

SELECT `testmethods`.* FROM `testmethods` ORDER BY name
---
  def index
    @testmethods = Testmethod.all