app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY name, name
---
  def index
    @users = User.order(:name)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `salt`, `hashed_password`, `name`, `updated_at`) VALUES ('2011-01-20 06:46:00', '-6138015780.0229591097195965', '027f83f315e2944c148d58a30ae61c4e1f9a4fc37da7fc5db800ff983b4b0c4d', 'chaitanya', '2011-01-20 06:46:00')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-01-28 05:26:09', `hashed_password` = 'fb726d54c75f420762cf95fe651badb816bab35f0212bcb8fc3a6598d555918c', `salt` = '-6126592280.282830081837763' WHERE (`users`.`id` = 1)
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])