app/controllers/userroles_controller.rb

  def index
    @userroles = Userrole.all
---
SELECT `userroles`.* FROM `userroles` ORDER BY name

  def show
    @userrole = Userrole.find(params[:id])
---
SELECT `userroles`.* FROM `userroles` WHERE (`userroles`.`id` = 1) ORDER BY name LIMIT 1

  def edit
    @userrole = Userrole.find(params[:id])
---
SELECT `userroles`.* FROM `userroles` WHERE (`userroles`.`id` = 1) LIMIT 1

  def create
    @userrole = Userrole.new(params[:userrole])

    respond_to do |format|
      if @userrole.save
---
INSERT INTO `userroles` (`created_at`, `name`, `updated_at`, `description`, `status`) VALUES ('2011-01-29 06:04:29', 'Administrator', '2011-01-29 06:04:29', 'Administrator', 'A')

  def update
    @userrole = Userrole.find(params[:id])
---
SELECT `userroles`.* FROM `userroles` WHERE (`userroles`.`id` = 1) LIMIT 1