app/controllers/warehouses_controller.rb

INSERT INTO `warehouses` (`updated_at`, `whnickname`, `status`, `modified_by`, `whnumber`, `whaddress`, `created_by`, `created_at`) VALUES ('2011-01-17 11:14:31', 'Warehouse', 'A', NULL, '1234', NULL, NULL, '2011-01-17 11:14:31')
---
  def create
    @warehouse = Warehouse.new(params[:warehouse])

    respond_to do |format|
      if @warehouse.save