app/views/cities/_form.html.erb

    <td>
<%= f.collection_select :country_id, Country.find(:all), :id, :name ,{:prompt=>'Select Country'},{ :onchange=>"#{remote_function(:url=>{:action=>'load_states'},:with =>"'id='+value")}" }%>
---
SELECT `countries`.* FROM `countries` ORDER BY name
SELECT `states`.* FROM `states` ORDER BY name