app/views/cities/show.html.erb

    <td>State</td>
    <td><%= @city.country.name %></td>
---
SELECT `countries`.* FROM `countries`