app/views/products/_form.html.erb

   <td> <%= f.label :id , "Category"%></td>
    <td><%= f.collection_select :category_id, Category.find(:all), :id, :name ,{:prompt=>'Select Categoery'},{ :onchange=>"#{remote_function(:url=>{:action=>'load_subcategries'},:with =>"'id='+value")}" }%></td>
---
SELECT `categories`.* FROM `categories` ORDER BY name